package com.thinkgem.jeesite.common.trafficUtils;


import com.alibaba.fastjson.JSON;
import com.openapi.sdk.service.DataExchangeService;
import com.openapi.sdk.service.TransCode;

/***
 * 接口客户端调用示例
 * 该文件使用UTF-8编码格式
 * 执行该例子前，需要导入证书到运行环境：
 * keytool.exe -import -trustcacerts -alias testopen -file "D:\JavaTeam\4__.95155.com.crt" -keystore "d:\JavaTeam\JavaHome\jdk1.6.0_18\jre\lib\security\cacerts" -storepass changeit
 */
public class ZhiyunOpenapi {

//  正式的账号数据
	private static String apiUrl="https://zhiyunopenapi.95155.com/apis";
	private static String apiUser ="6a2cd340-e03b-4fa9-945c-431b98ecef95";
	private static String password = "61K2b0X1423HYF32lDu656P4vzX006";
	private static String client_id ="74543156-4d0b-4c3d-a269-ad612631a9ad";
//	测试的账号数据
//	private static String apiUrl = "https://testopen.95155.com/apis";//联调测试环境接口地址
//	private static String apiUser = "cd9d13d4-9e7b-47d8-83a7-74dc04fe4c46";//这里需要替换成：您的API账号
//	private static String password = "i819edhs9r13eq1b1pbK358j47u42s";//这里需要替换成：您的API账号密码
//	private static String client_id = "87971efe-175d-4a3d-9f03-afdac2469791";//这里需要替换成：您的客户端ID
//	
//	private static String apiUser = "eee74e27-ba4e-4212-a60d-b5073d58c7b6";
//	private static String password = "e96E5lcer60308Ce7m11N5BX6tSC3k";
//	private static String client_id = "7337e83f-0ec0-4567-9345-56e2e4c0e9ef";
//	
//	private static String token ;//动态令牌，调用登录接口获取，建议将其缓存到第三方缓存服务中
	
	/** 调用示例 **/
	public static void main(String[] args)throws Exception {
		//第一步，调用登录接口获取Token
//		DemoReturnBean bean = login();
//		token = bean.getResult()+"";//将令牌缓存，令牌有效期默认3天
		
		//第二步，调用业务接口
//		vLastLocation(s,token);//一、车辆最新位置查询（车牌号）接口
//		vLastLocationVin();//二、车辆最新位置查询（vin车架号）接口
//		vLastLocationMulti();//三、	多车最新位置查询接口
//		vHisTrack24();//四、	车辆轨迹查询（车牌号）接口
//		vHisTrackVin24();//五、	车辆轨迹查询（vin车架号）接口
//		checkTruckExist();//六、	车辆入网验证
//		checkVehicleExist();//七、	车辆确认接口
//		checkOwnerByVclNo();//八、	车主真实性验证接口
//		checkAreaByVclNo();//九、	套牌车验证
//		pubGoodsSorcInf();//十、	发布货源接口
//		queryVclByMulFs();//十一、	找车接口->多维度找车
//		queryInfoByVid(token,"6648016378581982626");//十一、	找车接口->车辆ID获取车主信息
//		areaReg();//十二、	车辆驶入/驶出->自定义区域注册接口
//		vnoReg();//十二、	车辆驶入/驶出->车辆订阅接口
//		vnoDel();//十二、	车辆驶入/驶出->删除车辆订阅接口
//		areaDel();//十二、	车辆驶入/驶出->删除自定义区域接口
//		vnoOutReg();//十三、	异常离线提示->离线车辆注册接口
//		vnoOutDel();//十三、	异常离线提示->删除离线车辆订阅接口
//		vQueryPark();//十四、车辆停车查询接口
//		sendMessageByVclNo();//十五、下发车机信息接口
//		vQueryMileage();//十六、车辆里程查询接口
//		checkRTCNo();//十七、道路运输证验证接口
//		vQueryLicense();//十八、车辆行驶证信息查询接口
//		decodeAddress();//十九、逆地理信息查询接口
//		vQueryRTCNo();//二十、道路运输证查询接口
//		pubGoodsMsg();//二十一、发布货源短信接口
	}
	
	/** API用户登陆 
	 * 用户首次调用接口，须先登录，认证通过后生成令牌。
		令牌有效期默认为3天，登录后之前的令牌将立即失效，多服务调用业务接口时，建议由统一服务调用登录接口将令牌缓存起来，多个服务统一从共享缓存中获取令牌。
		令牌失效后再调用登录接口获取令牌，避免频繁调用登录接口，建议一天内登录次数不超过10次，超过10次将触发安全系统报警。
		返回值示例：
		{"result":"b1b5d200-588b-4b56-90c6-42ea5435cf2b","status":1001}
	 * */
	public static ZhiyunReturnBean login() {
		try {
			System.out.println("API用户登陆 ");
			String p = "user="+apiUser+"&pwd="+password;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/login/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return bean;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
			return null;
		}
	}

	/** 一、	车辆最新位置查询（车牌号）接口
	 * 本接口提供指定车牌号的车辆最新位置查询。
	 * 返回值示例：
	 * {"result":{"adr":"安徽省安庆市怀宁县金拱服务区－公厕，向东北方向，89米","drc":"244","lat":"18465990","lon":"70113699","spd":"20.0","utc":"1496826330000"},"status":1001}
	 *  */
	public static String vLastLocation(String token,String vclN,String timeNearby) {
		try {
			System.out.println("一、	车辆最新位置查询（车牌号）接口");
			String p = "token="+token+"&vclN="+vclN+"&timeNearby="+timeNearby;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vLastLocation/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}

	
	
	/** 二、	车辆最新位置查询（vin车架号）接口
	 * 本接口提供指定vin车架号的车辆最新位置查询。
	 * 返回值示例：
	 * {"result":{"adr":"北京市海淀区学院路３７北京航空航天大学北京航空航天大学－新主楼Ｄ座，向西北方向，28米","drc":"0","lat":"23986841","lon":"69807550","spd":"60.0","utc":"1495006942000"},"status":1001}
	 *  */
	public static String vLastLocationVin(String token,String vin,String timeNearby) {
		try {
			System.out.println("二、	车辆最新位置查询（vin车架号）接口");
			String p = "token="+token+"&vin="+vin+"&timeNearby="+timeNearby;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vLastLocationVin/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 三、	多车最新位置查询接口
	 * 在地图上可实时查看车机上报的车辆最新位置信息，包括经纬度、速度、方向、ACC状态等信息。
	 * 本接口提供指定多个车牌号的车辆最新位置查询，车牌号与车牌号之间以半角逗号连接,车牌号最大不超过100个。
	 * 接口返回数据解码后样例：
	{"result":[{"adr":"安徽省安庆市怀宁县长琳塑业，向西方向，148米","drc":"225","lat":"18451089","lon":"70094469","spd":"73.0","utc":"1496826420000","vno":"陕YH0009"},{"adr":"","drc":"","lat":"","lon":"","spd":"","utc":"","vno":"陕XB0066"},{"adr":"","drc":"","lat":"","lon":"","spd":"","utc":"","vno":"陕XB0059"},{"adr":"","drc":"","lat":"","lon":"","spd":"","utc":"","vno":"陕XB0058"}],"status":1001}
	 *  */
	public static String vLastLocationMulti(String token,String vclNs,String timeNearby) {
		try {
			System.out.println("三、	多车最新位置查询接口");
			String p = "token="+token+"&vclNs="+vclNs+"&timeNearby="+timeNearby;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vLastLocationMulti/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 四、	车辆轨迹查询（车牌号）接口
	 * 本接口提供指定车牌号，指定时间段查询车辆历史轨迹数据服务，开始时间和结束时间不能超过24小
	 * 接口返回数据解码后样例：
{"result":[{"agl":"219","gtm":"20170406/090130","hgt":"74","lat":"17046729","lon":"67891179","mlg":"151654","spd":"730"},{"agl":"218","gtm":"20170406/090200","hgt":"63","lat":"17041560","lon":"67886220","mlg":"151656","spd":"850"},{"agl":"209","gtm":"20170406/090230","hgt":"57","lat":"17035389","lon":"67881360","mlg":"151658","spd":"840"},{"agl":"199","gtm":"20170406/090300","hgt":"67","lat":"17028510","lon":"67877899","mlg":"151660","spd":"870"},{"agl":"201","gtm":"20170406/090330","hgt":"68","lat":"17021130","lon":"67874899","mlg":"151662","spd":"880"},{"agl":"217","gtm":"20170406/090400","hgt":"65","lat":"17014380","lon":"67870680","mlg":"151664","spd":"880"},{"agl":"219","gtm":"20170406/090430","hgt":"62","lat":"17008249","lon":"67864929","mlg":"151666","spd":"860"},{"agl":"219","gtm":"20170406/090500","hgt":"54","lat":"17002189","lon":"67859229","mlg":"151668","spd":"920"},{"agl":"208","gtm":"20170406/090530","hgt":"55","lat":"16996110","lon":"67854519","mlg":"151670","spd":"770"},{"agl":"203","gtm":"20170406/090600","hgt":"56","lat":"16989570","lon":"67851240","mlg":"151672","spd":"790"},{"agl":"202","gtm":"20170406/090630","hgt":"46","lat":"16982280","lon":"67847619","mlg":"151674","spd":"860"},{"agl":"193","gtm":"20170406/090700","hgt":"47","lat":"16974679","lon":"67844899","mlg":"151676","spd":"890"},{"agl":"199","gtm":"20170406/090730","hgt":"56","lat":"16967640","lon":"67842889","mlg":"151678","spd":"570"},{"agl":"193","gtm":"20170406/090800","hgt":"50","lat":"16962039","lon":"67840740","mlg":"151680","spd":"830"},{"agl":"175","gtm":"20170406/090830","hgt":"70","lat":"16954410","lon":"67840380","mlg":"151682","spd":"830"},{"agl":"188","gtm":"20170406/090900","hgt":"54","lat":"16946569","lon":"67840809","mlg":"151684","spd":"880"},{"agl":"201","gtm":"20170406/090930","hgt":"55","lat":"16938990","lon":"67837389","mlg":"151686","spd":"940"},{"agl":"185","gtm":"20170406/091000","hgt":"42","lat":"16930749","lon":"67835239","mlg":"151688","spd":"960"},{"agl":"185","gtm":"20170406/091030","hgt":"45","lat":"16921989","lon":"67834290","mlg":"151690","spd":"980"},{"agl":"205","gtm":"20170406/091100","hgt":"40","lat":"16915009","lon":"67832850","mlg":"151692","spd":"660"},{"agl":"175","gtm":"20170406/091130","hgt":"53","lat":"16886929","lon":"67828669","mlg":"151694","spd":"690"},{"agl":"206","gtm":"20170406/091200","hgt":"42","lat":"16910109","lon":"67829989","mlg":"151696","spd":"640"},{"agl":"201","gtm":"20170406/091230","hgt":"41","lat":"16904679","lon":"67827030","mlg":"151698","spd":"750"},{"agl":"159","gtm":"20170406/091300","hgt":"37","lat":"16898280","lon":"67826880","mlg":"151700","spd":"640"},{"agl":"170","gtm":"20170406/091330","hgt":"34","lat":"16892719","lon":"67827990","mlg":"151702","spd":"510"},{"agl":"156","gtm":"20170406/091400","hgt":"50","lat":"16879969","lon":"67830009","mlg":"151704","spd":"780"},{"agl":"156","gtm":"20170406/091430","hgt":"62","lat":"16873849","lon":"67834129","mlg":"151706","spd":"750"},{"agl":"184","gtm":"20170406/091500","hgt":"83","lat":"16868119","lon":"67834650","mlg":"151708","spd":"480"},{"agl":"184","gtm":"20170406/091530","hgt":"78","lat":"16861969","lon":"67834149","mlg":"151710","spd":"770"},{"agl":"217","gtm":"20170406/091600","hgt":"73","lat":"16854849","lon":"67831489","mlg":"151712","spd":"800"},{"agl":"195","gtm":"20170406/091630","hgt":"78","lat":"16847880","lon":"67828489","mlg":"151714","spd":"850"},{"agl":"206","gtm":"20170406/091700","hgt":"76","lat":"16841029","lon":"67825080","mlg":"151716","spd":"860"},{"agl":"193","gtm":"20170406/091730","hgt":"107","lat":"16834440","lon":"67822689","mlg":"151718","spd":"680"},{"agl":"182","gtm":"20170406/091800","hgt":"81","lat":"16826709","lon":"67821279","mlg":"151720","spd":"900"},{"agl":"193","gtm":"20170406/091830","hgt":"71","lat":"16818679","lon":"67819410","mlg":"151722","spd":"940"},{"agl":"162","gtm":"20170406/091900","hgt":"62","lat":"16810650","lon":"67818399","mlg":"151724","spd":"890"},{"agl":"140","gtm":"20170406/091930","hgt":"82","lat":"16806630","lon":"67821529","mlg":"151726","spd":"310"},{"agl":"175","gtm":"20170406/092000","hgt":"75","lat":"16802790","lon":"67823379","mlg":"151728","spd":"470"},{"agl":"160","gtm":"20170406/092030","hgt":"51","lat":"16797739","lon":"67824999","mlg":"151730","spd":"680"},{"agl":"182","gtm":"20170406/092100","hgt":"60","lat":"16791420","lon":"67825200","mlg":"151732","spd":"750"},{"agl":"181","gtm":"20170406/092130","hgt":"39","lat":"16784190","lon":"67822449","mlg":"151734","spd":"790"},{"agl":"181","gtm":"20170406/092200","hgt":"31","lat":"16776579","lon":"67823269","mlg":"151736","spd":"810"},{"agl":"205","gtm":"20170406/092230","hgt":"50","lat":"16769719","lon":"67822099","mlg":"151738","spd":"590"},{"agl":"199","gtm":"20170406/092300","hgt":"54","lat":"16764619","lon":"67819359","mlg":"151740","spd":"640"},{"agl":"173","gtm":"20170406/092330","hgt":"34","lat":"16757310","lon":"67819339","mlg":"151742","spd":"860"},{"agl":"202","gtm":"20170406/092400","hgt":"34","lat":"16749529","lon":"67818199","mlg":"151744","spd":"890"},{"agl":"222","gtm":"20170406/092430","hgt":"46","lat":"16742409","lon":"67814359","mlg":"151746","spd":"890"},{"agl":"168","gtm":"20170406/092500","hgt":"45","lat":"16734789","lon":"67813189","mlg":"151748","spd":"820"},{"agl":"206","gtm":"20170406/092530","hgt":"62","lat":"16727250","lon":"67812879","mlg":"151750","spd":"790"},{"agl":"194","gtm":"20170406/092600","hgt":"57","lat":"16720059","lon":"67811580","mlg":"151752","spd":"850"},{"agl":"160","gtm":"20170406/092630","hgt":"49","lat":"16712389","lon":"67811580","mlg":"151754","spd":"840"},{"agl":"131","gtm":"20170406/092700","hgt":"55","lat":"16706659","lon":"67816440","mlg":"151756","spd":"810"},{"agl":"132","gtm":"20170406/092730","hgt":"37","lat":"16701219","lon":"67823029","mlg":"151758","spd":"840"},{"agl":"156","gtm":"20170406/092800","hgt":"72","lat":"16695630","lon":"67827840","mlg":"151760","spd":"730"},{"agl":"181","gtm":"20170406/092830","hgt":"58","lat":"16688119","lon":"67829559","mlg":"151762","spd":"910"},{"agl":"186","gtm":"20170406/092900","hgt":"46","lat":"16679929","lon":"67828530","mlg":"151764","spd":"890"},{"agl":"199","gtm":"20170406/092930","hgt":"57","lat":"16672609","lon":"67827090","mlg":"151766","spd":"820"},{"agl":"183","gtm":"20170406/093000","hgt":"67","lat":"16665150","lon":"67825080","mlg":"151768","spd":"850"},{"agl":"178","gtm":"20170406/093030","hgt":"70","lat":"16657579","lon":"67825299","mlg":"151770","spd":"830"},{"agl":"195","gtm":"20170406/093100","hgt":"67","lat":"16650009","lon":"67824049","mlg":"151772","spd":"890"},{"agl":"175","gtm":"20170406/093130","hgt":"70","lat":"16642050","lon":"67822699","mlg":"151774","spd":"850"},{"agl":"174","gtm":"20170406/093200","hgt":"76","lat":"16634109","lon":"67824330","mlg":"151776","spd":"870"},{"agl":"194","gtm":"20170406/093230","hgt":"76","lat":"16626489","lon":"67822839","mlg":"151778","spd":"890"},{"agl":"182","gtm":"20170406/093300","hgt":"78","lat":"16619049","lon":"67821039","mlg":"151780","spd":"870"},{"agl":"162","gtm":"20170406/093330","hgt":"96","lat":"16611349","lon":"67822459","mlg":"151782","spd":"740"},{"agl":"176","gtm":"20170406/093400","hgt":"96","lat":"16604389","lon":"67823850","mlg":"151784","spd":"840"},{"agl":"179","gtm":"20170406/093431","hgt":"90","lat":"16596879","lon":"67824019","mlg":"151786","spd":"690"},{"agl":"187","gtm":"20170406/093501","hgt":"83","lat":"16589619","lon":"67823539","mlg":"151788","spd":"1020"},{"agl":"186","gtm":"20170406/093531","hgt":"59","lat":"16580790","lon":"67822380","mlg":"151790","spd":"930"},{"agl":"179","gtm":"20170406/093601","hgt":"67","lat":"16572049","lon":"67821559","mlg":"151792","spd":"930"},{"agl":"179","gtm":"20170406/093631","hgt":"73","lat":"16563969","lon":"67822089","mlg":"151794","spd":"690"},{"agl":"184","gtm":"20170406/093701","hgt":"93","lat":"16560019","lon":"67821859","mlg":"151796","spd":"340"},{"agl":"186","gtm":"20170406/093731","hgt":"76","lat":"16553970","lon":"67821079","mlg":"151798","spd":"940"},{"agl":"187","gtm":"20170406/093801","hgt":"70","lat":"16545559","lon":"67820019","mlg":"151800","spd":"880"},{"agl":"179","gtm":"20170406/093831","hgt":"69","lat":"16537579","lon":"67819380","mlg":"151802","spd":"880"},{"agl":"174","gtm":"20170406/093901","hgt":"76","lat":"16529419","lon":"67820089","mlg":"151804","spd":"930"},{"agl":"178","gtm":"20170406/093931","hgt":"63","lat":"16521060","lon":"67820829","mlg":"151806","spd":"880"},{"agl":"189","gtm":"20170406/094001","hgt":"85","lat":"16513170","lon":"67819980","mlg":"151808","spd":"870"},{"agl":"186","gtm":"20170406/094031","hgt":"85","lat":"16505799","lon":"67818720","mlg":"151810","spd":"760"},{"agl":"179","gtm":"20170406/094101","hgt":"71","lat":"16497840","lon":"67818559","mlg":"151812","spd":"940"},{"agl":"178","gtm":"20170406/094131","hgt":"74","lat":"16489380","lon":"67818690","mlg":"151814","spd":"940"},{"agl":"191","gtm":"20170406/094201","hgt":"86","lat":"16481169","lon":"67817899","mlg":"151816","spd":"870"},{"agl":"189","gtm":"20170406/094231","hgt":"87","lat":"16473259","lon":"67815780","mlg":"151818","spd":"850"},{"agl":"180","gtm":"20170406/094301","hgt":"84","lat":"16465569","lon":"67814989","mlg":"151820","spd":"870"},{"agl":"172","gtm":"20170406/094331","hgt":"81","lat":"16457629","lon":"67815729","mlg":"151822","spd":"870"},{"agl":"175","gtm":"20170406/094401","hgt":"71","lat":"16449510","lon":"67816839","mlg":"151824","spd":"840"},{"agl":"197","gtm":"20170406/094431","hgt":"77","lat":"16418310","lon":"67814439","mlg":"151826","spd":"870"},{"agl":"183","gtm":"20170406/094501","hgt":"64","lat":"16441950","lon":"67816809","mlg":"151828","spd":"870"},{"agl":"184","gtm":"20170406/094531","hgt":"63","lat":"16433989","lon":"67816279","mlg":"151830","spd":"930"},{"agl":"183","gtm":"20170406/094601","hgt":"60","lat":"16425879","lon":"67815699","mlg":"151832","spd":"830"},{"agl":"216","gtm":"20170406/094631","hgt":"89","lat":"16411549","lon":"67810590","mlg":"151834","spd":"810"},{"agl":"228","gtm":"20170406/094701","hgt":"76","lat":"16405860","lon":"67804359","mlg":"151836","spd":"860"},{"agl":"221","gtm":"20170406/094731","hgt":"79","lat":"16400340","lon":"67797690","mlg":"151838","spd":"880"},{"agl":"204","gtm":"20170406/094801","hgt":"88","lat":"16394010","lon":"67793430","mlg":"151840","spd":"790"},{"agl":"206","gtm":"20170406/094831","hgt":"66","lat":"16386489","lon":"67789620","mlg":"151842","spd":"980"},{"agl":"219","gtm":"20170406/094901","hgt":"67","lat":"16379340","lon":"67784349","mlg":"151844","spd":"940"},{"agl":"232","gtm":"20170406/094931","hgt":"74","lat":"16373709","lon":"67777800","mlg":"151846","spd":"910"},{"agl":"235","gtm":"20170406/095001","hgt":"65","lat":"16368709","lon":"67769880","mlg":"151848","spd":"960"},{"agl":"231","gtm":"20170406/095031","hgt":"72","lat":"16363729","lon":"67761939","mlg":"151850","spd":"940"},{"agl":"221","gtm":"20170406/095101","hgt":"70","lat":"16357819","lon":"67754829","mlg":"151852","spd":"920"},{"agl":"224","gtm":"20170406/095131","hgt":"70","lat":"16351659","lon":"67748919","mlg":"151854","spd":"850"},{"agl":"223","gtm":"20170406/095201","hgt":"73","lat":"16345989","lon":"67741980","mlg":"151856","spd":"900"},{"agl":"210","gtm":"20170406/095231","hgt":"79","lat":"16339999","lon":"67737079","mlg":"151858","spd":"900"},{"agl":"208","gtm":"20170406/095301","hgt":"92","lat":"16333560","lon":"67733619","mlg":"151860","spd":"810"},{"agl":"206","gtm":"20170406/095331","hgt":"95","lat":"16327069","lon":"67729419","mlg":"151862","spd":"820"},{"agl":"178","gtm":"20170406/095401","hgt":"100","lat":"16321440","lon":"67728150","mlg":"151864","spd":"540"},{"agl":"168","gtm":"20170406/095431","hgt":"106","lat":"16315179","lon":"67728169","mlg":"151866","spd":"720"},{"agl":"201","gtm":"20170406/095501","hgt":"76","lat":"16307409","lon":"67729159","mlg":"151868","spd":"930"},{"agl":"194","gtm":"20170406/095531","hgt":"58","lat":"16299309","lon":"67727289","mlg":"151870","spd":"930"},{"agl":"196","gtm":"20170406/095601","hgt":"62","lat":"16291140","lon":"67724449","mlg":"151872","spd":"980"},{"agl":"210","gtm":"20170406/095631","hgt":"75","lat":"16284069","lon":"67721469","mlg":"151874","spd":"800"},{"agl":"210","gtm":"20170406/095701","hgt":"62","lat":"16277709","lon":"67716000","mlg":"151876","spd":"940"},{"agl":"180","gtm":"20170406/095731","hgt":"86","lat":"16269780","lon":"67714129","mlg":"151878","spd":"910"},{"agl":"203","gtm":"20170406/095801","hgt":"88","lat":"16261819","lon":"67712209","mlg":"151880","spd":"900"},{"agl":"195","gtm":"20170406/095831","hgt":"88","lat":"16254519","lon":"67708929","mlg":"151882","spd":"910"},{"agl":"181","gtm":"20170406/095901","hgt":"57","lat":"16245750","lon":"67708099","mlg":"151884","spd":"970"},{"agl":"193","gtm":"20170406/095931","hgt":"72","lat":"16237959","lon":"67706559","mlg":"151886","spd":"850"}],"status":1001}
	 *  */
	public static String vHisTrack24(String token,String vclN ,String qryBtm ,String qryEtm) {
		try {
			System.out.println("四、	车辆轨迹查询（车牌号）接口");
			String p = "token="+token+"&vclN="+vclN+"&qryBtm="+qryBtm+"&qryEtm="+qryEtm;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vHisTrack24/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 五、	车辆轨迹查询（vin车架号）接口
	 * 本接口提供指定vin车架号，指定时间段查询车辆的轨迹服务，单次查询时间段范围不能超过24小时。
	 * 接口返回数据解码后样例：
{"result":[{"agl":"219","alc":"0","bst":"3","est":"","gtm":"20170406/090130","hgt":"74","lat":"17046729","lon":"67891179","mlg":"151654","spd":"730"},{"agl":"218","alc":"0","bst":"3","est":"","gtm":"20170406/090200","hgt":"63","lat":"17041560","lon":"67886220","mlg":"151656","spd":"850"},{"agl":"209","alc":"0","bst":"3","est":"","gtm":"20170406/090230","hgt":"57","lat":"17035389","lon":"67881360","mlg":"151658","spd":"840"},{"agl":"199","alc":"0","bst":"3","est":"","gtm":"20170406/090300","hgt":"67","lat":"17028510","lon":"67877899","mlg":"151660","spd":"870"},{"agl":"201","alc":"0","bst":"3","est":"","gtm":"20170406/090330","hgt":"68","lat":"17021130","lon":"67874899","mlg":"151662","spd":"880"},{"agl":"217","alc":"0","bst":"3","est":"","gtm":"20170406/090400","hgt":"65","lat":"17014380","lon":"67870680","mlg":"151664","spd":"880"},{"agl":"219","alc":"0","bst":"3","est":"","gtm":"20170406/090430","hgt":"62","lat":"17008249","lon":"67864929","mlg":"151666","spd":"860"},{"agl":"219","alc":"0","bst":"3","est":"","gtm":"20170406/090500","hgt":"54","lat":"17002189","lon":"67859229","mlg":"151668","spd":"920"},{"agl":"208","alc":"0","bst":"3","est":"","gtm":"20170406/090530","hgt":"55","lat":"16996110","lon":"67854519","mlg":"151670","spd":"770"},{"agl":"203","alc":"0","bst":"3","est":"","gtm":"20170406/090600","hgt":"56","lat":"16989570","lon":"67851240","mlg":"151672","spd":"790"},{"agl":"202","alc":"0","bst":"3","est":"","gtm":"20170406/090630","hgt":"46","lat":"16982280","lon":"67847619","mlg":"151674","spd":"860"},{"agl":"193","alc":"0","bst":"3","est":"","gtm":"20170406/090700","hgt":"47","lat":"16974679","lon":"67844899","mlg":"151676","spd":"890"},{"agl":"199","alc":"0","bst":"3","est":"","gtm":"20170406/090730","hgt":"56","lat":"16967640","lon":"67842889","mlg":"151678","spd":"570"},{"agl":"193","alc":"0","bst":"3","est":"","gtm":"20170406/090800","hgt":"50","lat":"16962039","lon":"67840740","mlg":"151680","spd":"830"},{"agl":"175","alc":"0","bst":"3","est":"","gtm":"20170406/090830","hgt":"70","lat":"16954410","lon":"67840380","mlg":"151682","spd":"830"},{"agl":"188","alc":"0","bst":"3","est":"","gtm":"20170406/090900","hgt":"54","lat":"16946569","lon":"67840809","mlg":"151684","spd":"880"},{"agl":"201","alc":"0","bst":"3","est":"","gtm":"20170406/090930","hgt":"55","lat":"16938990","lon":"67837389","mlg":"151686","spd":"940"},{"agl":"185","alc":"0","bst":"3","est":"","gtm":"20170406/091000","hgt":"42","lat":"16930749","lon":"67835239","mlg":"151688","spd":"960"},{"agl":"185","alc":"0","bst":"3","est":"","gtm":"20170406/091030","hgt":"45","lat":"16921989","lon":"67834290","mlg":"151690","spd":"980"},{"agl":"205","alc":"0","bst":"3","est":"","gtm":"20170406/091100","hgt":"40","lat":"16915009","lon":"67832850","mlg":"151692","spd":"660"},{"agl":"175","alc":"0","bst":"3","est":"","gtm":"20170406/091130","hgt":"53","lat":"16886929","lon":"67828669","mlg":"151694","spd":"690"},{"agl":"206","alc":"0","bst":"3","est":"","gtm":"20170406/091200","hgt":"42","lat":"16910109","lon":"67829989","mlg":"151696","spd":"640"},{"agl":"201","alc":"0","bst":"3","est":"","gtm":"20170406/091230","hgt":"41","lat":"16904679","lon":"67827030","mlg":"151698","spd":"750"},{"agl":"159","alc":"0","bst":"3","est":"","gtm":"20170406/091300","hgt":"37","lat":"16898280","lon":"67826880","mlg":"151700","spd":"640"},{"agl":"170","alc":"0","bst":"3","est":"","gtm":"20170406/091330","hgt":"34","lat":"16892719","lon":"67827990","mlg":"151702","spd":"510"},{"agl":"156","alc":"0","bst":"3","est":"","gtm":"20170406/091400","hgt":"50","lat":"16879969","lon":"67830009","mlg":"151704","spd":"780"},{"agl":"156","alc":"0","bst":"3","est":"","gtm":"20170406/091430","hgt":"62","lat":"16873849","lon":"67834129","mlg":"151706","spd":"750"},{"agl":"184","alc":"0","bst":"3","est":"","gtm":"20170406/091500","hgt":"83","lat":"16868119","lon":"67834650","mlg":"151708","spd":"480"},{"agl":"184","alc":"0","bst":"3","est":"","gtm":"20170406/091530","hgt":"78","lat":"16861969","lon":"67834149","mlg":"151710","spd":"770"},{"agl":"217","alc":"0","bst":"3","est":"","gtm":"20170406/091600","hgt":"73","lat":"16854849","lon":"67831489","mlg":"151712","spd":"800"},{"agl":"195","alc":"0","bst":"3","est":"","gtm":"20170406/091630","hgt":"78","lat":"16847880","lon":"67828489","mlg":"151714","spd":"850"},{"agl":"206","alc":"0","bst":"3","est":"","gtm":"20170406/091700","hgt":"76","lat":"16841029","lon":"67825080","mlg":"151716","spd":"860"},{"agl":"193","alc":"0","bst":"3","est":"","gtm":"20170406/091730","hgt":"107","lat":"16834440","lon":"67822689","mlg":"151718","spd":"680"},{"agl":"182","alc":"0","bst":"3","est":"","gtm":"20170406/091800","hgt":"81","lat":"16826709","lon":"67821279","mlg":"151720","spd":"900"},{"agl":"193","alc":"0","bst":"3","est":"","gtm":"20170406/091830","hgt":"71","lat":"16818679","lon":"67819410","mlg":"151722","spd":"940"},{"agl":"162","alc":"0","bst":"3","est":"","gtm":"20170406/091900","hgt":"62","lat":"16810650","lon":"67818399","mlg":"151724","spd":"890"},{"agl":"140","alc":"0","bst":"3","est":"","gtm":"20170406/091930","hgt":"82","lat":"16806630","lon":"67821529","mlg":"151726","spd":"310"},{"agl":"175","alc":"0","bst":"3","est":"","gtm":"20170406/092000","hgt":"75","lat":"16802790","lon":"67823379","mlg":"151728","spd":"470"},{"agl":"160","alc":"0","bst":"3","est":"","gtm":"20170406/092030","hgt":"51","lat":"16797739","lon":"67824999","mlg":"151730","spd":"680"},{"agl":"182","alc":"0","bst":"3","est":"","gtm":"20170406/092100","hgt":"60","lat":"16791420","lon":"67825200","mlg":"151732","spd":"750"},{"agl":"181","alc":"0","bst":"3","est":"","gtm":"20170406/092130","hgt":"39","lat":"16784190","lon":"67822449","mlg":"151734","spd":"790"},{"agl":"181","alc":"0","bst":"3","est":"","gtm":"20170406/092200","hgt":"31","lat":"16776579","lon":"67823269","mlg":"151736","spd":"810"},{"agl":"205","alc":"0","bst":"3","est":"","gtm":"20170406/092230","hgt":"50","lat":"16769719","lon":"67822099","mlg":"151738","spd":"590"},{"agl":"199","alc":"0","bst":"3","est":"","gtm":"20170406/092300","hgt":"54","lat":"16764619","lon":"67819359","mlg":"151740","spd":"640"},{"agl":"173","alc":"0","bst":"3","est":"","gtm":"20170406/092330","hgt":"34","lat":"16757310","lon":"67819339","mlg":"151742","spd":"860"},{"agl":"202","alc":"0","bst":"3","est":"","gtm":"20170406/092400","hgt":"34","lat":"16749529","lon":"67818199","mlg":"151744","spd":"890"},{"agl":"222","alc":"0","bst":"3","est":"","gtm":"20170406/092430","hgt":"46","lat":"16742409","lon":"67814359","mlg":"151746","spd":"890"},{"agl":"168","alc":"0","bst":"3","est":"","gtm":"20170406/092500","hgt":"45","lat":"16734789","lon":"67813189","mlg":"151748","spd":"820"},{"agl":"206","alc":"0","bst":"3","est":"","gtm":"20170406/092530","hgt":"62","lat":"16727250","lon":"67812879","mlg":"151750","spd":"790"},{"agl":"194","alc":"0","bst":"3","est":"","gtm":"20170406/092600","hgt":"57","lat":"16720059","lon":"67811580","mlg":"151752","spd":"850"},{"agl":"160","alc":"0","bst":"3","est":"","gtm":"20170406/092630","hgt":"49","lat":"16712389","lon":"67811580","mlg":"151754","spd":"840"},{"agl":"131","alc":"0","bst":"3","est":"","gtm":"20170406/092700","hgt":"55","lat":"16706659","lon":"67816440","mlg":"151756","spd":"810"},{"agl":"132","alc":"0","bst":"3","est":"","gtm":"20170406/092730","hgt":"37","lat":"16701219","lon":"67823029","mlg":"151758","spd":"840"},{"agl":"156","alc":"0","bst":"3","est":"","gtm":"20170406/092800","hgt":"72","lat":"16695630","lon":"67827840","mlg":"151760","spd":"730"},{"agl":"181","alc":"0","bst":"3","est":"","gtm":"20170406/092830","hgt":"58","lat":"16688119","lon":"67829559","mlg":"151762","spd":"910"},{"agl":"186","alc":"0","bst":"3","est":"","gtm":"20170406/092900","hgt":"46","lat":"16679929","lon":"67828530","mlg":"151764","spd":"890"},{"agl":"199","alc":"0","bst":"3","est":"","gtm":"20170406/092930","hgt":"57","lat":"16672609","lon":"67827090","mlg":"151766","spd":"820"},{"agl":"183","alc":"0","bst":"3","est":"","gtm":"20170406/093000","hgt":"67","lat":"16665150","lon":"67825080","mlg":"151768","spd":"850"},{"agl":"178","alc":"0","bst":"3","est":"","gtm":"20170406/093030","hgt":"70","lat":"16657579","lon":"67825299","mlg":"151770","spd":"830"},{"agl":"195","alc":"0","bst":"3","est":"","gtm":"20170406/093100","hgt":"67","lat":"16650009","lon":"67824049","mlg":"151772","spd":"890"},{"agl":"175","alc":"0","bst":"3","est":"","gtm":"20170406/093130","hgt":"70","lat":"16642050","lon":"67822699","mlg":"151774","spd":"850"},{"agl":"174","alc":"0","bst":"3","est":"","gtm":"20170406/093200","hgt":"76","lat":"16634109","lon":"67824330","mlg":"151776","spd":"870"},{"agl":"194","alc":"0","bst":"3","est":"","gtm":"20170406/093230","hgt":"76","lat":"16626489","lon":"67822839","mlg":"151778","spd":"890"},{"agl":"182","alc":"0","bst":"3","est":"","gtm":"20170406/093300","hgt":"78","lat":"16619049","lon":"67821039","mlg":"151780","spd":"870"},{"agl":"162","alc":"0","bst":"3","est":"","gtm":"20170406/093330","hgt":"96","lat":"16611349","lon":"67822459","mlg":"151782","spd":"740"},{"agl":"176","alc":"0","bst":"3","est":"","gtm":"20170406/093400","hgt":"96","lat":"16604389","lon":"67823850","mlg":"151784","spd":"840"},{"agl":"179","alc":"0","bst":"3","est":"","gtm":"20170406/093431","hgt":"90","lat":"16596879","lon":"67824019","mlg":"151786","spd":"690"},{"agl":"187","alc":"0","bst":"3","est":"","gtm":"20170406/093501","hgt":"83","lat":"16589619","lon":"67823539","mlg":"151788","spd":"1020"},{"agl":"186","alc":"0","bst":"3","est":"","gtm":"20170406/093531","hgt":"59","lat":"16580790","lon":"67822380","mlg":"151790","spd":"930"},{"agl":"179","alc":"0","bst":"3","est":"","gtm":"20170406/093601","hgt":"67","lat":"16572049","lon":"67821559","mlg":"151792","spd":"930"},{"agl":"179","alc":"0","bst":"3","est":"","gtm":"20170406/093631","hgt":"73","lat":"16563969","lon":"67822089","mlg":"151794","spd":"690"},{"agl":"184","alc":"0","bst":"3","est":"","gtm":"20170406/093701","hgt":"93","lat":"16560019","lon":"67821859","mlg":"151796","spd":"340"},{"agl":"186","alc":"0","bst":"3","est":"","gtm":"20170406/093731","hgt":"76","lat":"16553970","lon":"67821079","mlg":"151798","spd":"940"},{"agl":"187","alc":"0","bst":"3","est":"","gtm":"20170406/093801","hgt":"70","lat":"16545559","lon":"67820019","mlg":"151800","spd":"880"},{"agl":"179","alc":"0","bst":"3","est":"","gtm":"20170406/093831","hgt":"69","lat":"16537579","lon":"67819380","mlg":"151802","spd":"880"},{"agl":"174","alc":"0","bst":"3","est":"","gtm":"20170406/093901","hgt":"76","lat":"16529419","lon":"67820089","mlg":"151804","spd":"930"},{"agl":"178","alc":"0","bst":"3","est":"","gtm":"20170406/093931","hgt":"63","lat":"16521060","lon":"67820829","mlg":"151806","spd":"880"},{"agl":"189","alc":"0","bst":"3","est":"","gtm":"20170406/094001","hgt":"85","lat":"16513170","lon":"67819980","mlg":"151808","spd":"870"},{"agl":"186","alc":"0","bst":"3","est":"","gtm":"20170406/094031","hgt":"85","lat":"16505799","lon":"67818720","mlg":"151810","spd":"760"},{"agl":"179","alc":"0","bst":"3","est":"","gtm":"20170406/094101","hgt":"71","lat":"16497840","lon":"67818559","mlg":"151812","spd":"940"},{"agl":"178","alc":"0","bst":"3","est":"","gtm":"20170406/094131","hgt":"74","lat":"16489380","lon":"67818690","mlg":"151814","spd":"940"},{"agl":"191","alc":"0","bst":"3","est":"","gtm":"20170406/094201","hgt":"86","lat":"16481169","lon":"67817899","mlg":"151816","spd":"870"},{"agl":"189","alc":"0","bst":"3","est":"","gtm":"20170406/094231","hgt":"87","lat":"16473259","lon":"67815780","mlg":"151818","spd":"850"},{"agl":"180","alc":"0","bst":"3","est":"","gtm":"20170406/094301","hgt":"84","lat":"16465569","lon":"67814989","mlg":"151820","spd":"870"},{"agl":"172","alc":"0","bst":"3","est":"","gtm":"20170406/094331","hgt":"81","lat":"16457629","lon":"67815729","mlg":"151822","spd":"870"},{"agl":"175","alc":"0","bst":"3","est":"","gtm":"20170406/094401","hgt":"71","lat":"16449510","lon":"67816839","mlg":"151824","spd":"840"},{"agl":"197","alc":"0","bst":"3","est":"","gtm":"20170406/094431","hgt":"77","lat":"16418310","lon":"67814439","mlg":"151826","spd":"870"},{"agl":"183","alc":"0","bst":"3","est":"","gtm":"20170406/094501","hgt":"64","lat":"16441950","lon":"67816809","mlg":"151828","spd":"870"},{"agl":"184","alc":"0","bst":"3","est":"","gtm":"20170406/094531","hgt":"63","lat":"16433989","lon":"67816279","mlg":"151830","spd":"930"},{"agl":"183","alc":"0","bst":"3","est":"","gtm":"20170406/094601","hgt":"60","lat":"16425879","lon":"67815699","mlg":"151832","spd":"830"},{"agl":"216","alc":"0","bst":"3","est":"","gtm":"20170406/094631","hgt":"89","lat":"16411549","lon":"67810590","mlg":"151834","spd":"810"},{"agl":"228","alc":"0","bst":"3","est":"","gtm":"20170406/094701","hgt":"76","lat":"16405860","lon":"67804359","mlg":"151836","spd":"860"},{"agl":"221","alc":"0","bst":"3","est":"","gtm":"20170406/094731","hgt":"79","lat":"16400340","lon":"67797690","mlg":"151838","spd":"880"},{"agl":"204","alc":"0","bst":"3","est":"","gtm":"20170406/094801","hgt":"88","lat":"16394010","lon":"67793430","mlg":"151840","spd":"790"},{"agl":"206","alc":"0","bst":"3","est":"","gtm":"20170406/094831","hgt":"66","lat":"16386489","lon":"67789620","mlg":"151842","spd":"980"},{"agl":"219","alc":"0","bst":"3","est":"","gtm":"20170406/094901","hgt":"67","lat":"16379340","lon":"67784349","mlg":"151844","spd":"940"},{"agl":"232","alc":"0","bst":"3","est":"","gtm":"20170406/094931","hgt":"74","lat":"16373709","lon":"67777800","mlg":"151846","spd":"910"},{"agl":"235","alc":"0","bst":"3","est":"","gtm":"20170406/095001","hgt":"65","lat":"16368709","lon":"67769880","mlg":"151848","spd":"960"},{"agl":"231","alc":"0","bst":"3","est":"","gtm":"20170406/095031","hgt":"72","lat":"16363729","lon":"67761939","mlg":"151850","spd":"940"},{"agl":"221","alc":"0","bst":"3","est":"","gtm":"20170406/095101","hgt":"70","lat":"16357819","lon":"67754829","mlg":"151852","spd":"920"},{"agl":"224","alc":"0","bst":"3","est":"","gtm":"20170406/095131","hgt":"70","lat":"16351659","lon":"67748919","mlg":"151854","spd":"850"},{"agl":"223","alc":"0","bst":"3","est":"","gtm":"20170406/095201","hgt":"73","lat":"16345989","lon":"67741980","mlg":"151856","spd":"900"},{"agl":"210","alc":"0","bst":"3","est":"","gtm":"20170406/095231","hgt":"79","lat":"16339999","lon":"67737079","mlg":"151858","spd":"900"},{"agl":"208","alc":"0","bst":"3","est":"","gtm":"20170406/095301","hgt":"92","lat":"16333560","lon":"67733619","mlg":"151860","spd":"810"},{"agl":"206","alc":"0","bst":"3","est":"","gtm":"20170406/095331","hgt":"95","lat":"16327069","lon":"67729419","mlg":"151862","spd":"820"},{"agl":"178","alc":"0","bst":"3","est":"","gtm":"20170406/095401","hgt":"100","lat":"16321440","lon":"67728150","mlg":"151864","spd":"540"},{"agl":"168","alc":"0","bst":"3","est":"","gtm":"20170406/095431","hgt":"106","lat":"16315179","lon":"67728169","mlg":"151866","spd":"720"},{"agl":"201","alc":"0","bst":"3","est":"","gtm":"20170406/095501","hgt":"76","lat":"16307409","lon":"67729159","mlg":"151868","spd":"930"},{"agl":"194","alc":"0","bst":"3","est":"","gtm":"20170406/095531","hgt":"58","lat":"16299309","lon":"67727289","mlg":"151870","spd":"930"},{"agl":"196","alc":"0","bst":"3","est":"","gtm":"20170406/095601","hgt":"62","lat":"16291140","lon":"67724449","mlg":"151872","spd":"980"},{"agl":"210","alc":"0","bst":"3","est":"","gtm":"20170406/095631","hgt":"75","lat":"16284069","lon":"67721469","mlg":"151874","spd":"800"},{"agl":"210","alc":"0","bst":"3","est":"","gtm":"20170406/095701","hgt":"62","lat":"16277709","lon":"67716000","mlg":"151876","spd":"940"},{"agl":"180","alc":"0","bst":"3","est":"","gtm":"20170406/095731","hgt":"86","lat":"16269780","lon":"67714129","mlg":"151878","spd":"910"},{"agl":"203","alc":"0","bst":"3","est":"","gtm":"20170406/095801","hgt":"88","lat":"16261819","lon":"67712209","mlg":"151880","spd":"900"},{"agl":"195","alc":"0","bst":"3","est":"","gtm":"20170406/095831","hgt":"88","lat":"16254519","lon":"67708929","mlg":"151882","spd":"910"},{"agl":"181","alc":"0","bst":"3","est":"","gtm":"20170406/095901","hgt":"57","lat":"16245750","lon":"67708099","mlg":"151884","spd":"970"},{"agl":"193","alc":"0","bst":"3","est":"","gtm":"20170406/095931","hgt":"72","lat":"16237959","lon":"67706559","mlg":"151886","spd":"850"}],"status":1001}
	 *  */
	public static String vHisTrackVin24(String token,String vin,String qryBtm,String qryEtm) {
		try {
			System.out.println("五、	车辆轨迹查询（vin车架号）接口");
			String p = "token="+token+"&vin="+vin+"&qryBtm="+qryBtm+"&qryEtm="+qryEtm;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vHisTrackVin24/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
			return null;
	}
	
	/** 六、	车辆入网验证
	 * 提供按车牌号判断指定车辆是否在全国货运平台入网服务
	 * 接口返回数据解码后样例：
		{"result":"yes","status":1001}
	 *  */
	public static String checkTruckExist(String token,String vclN) {
		try {
			System.out.println("六、	车辆入网验证");
			String p = "token="+token+"&vclN="+vclN;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/checkTruckExist/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 七、	车辆确认接口
	 * 本接口提供指定车牌号的车辆查询，验证车辆是否存在，存在则返回最后定位时间
	 * 接口返回数据解码后样例：
		{"result":"1493975556000","status":1001} 
	 *  */
	public static String checkVehicleExist(String token,String vclN) {
		try {
			System.out.println("七、	车辆确认接口");
			String p = "token="+token+"&vclN="+vclN;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/checkVehicleExist/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 八、	车主真实性验证接口
	 * 本接口通过指定车牌号、车主姓名及车主电话，验证车主真实性。
	 * 接口返回数据解码后样例：
		 {"result":"yes","status":1001}
		或
		{"result":"name","status":1001}
		或
		{"result":"phone","status":1001}
	 *  */
	public static String checkOwnerByVclNo(String token,String vclN,String name, String phone) {
		try {
			System.out.println("八、	车主真实性验证接口");
			String p = "token="+token+"&vclN="+vclN+"&ownerName="+name+"&ownerPhone="+phone;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/checkOwnerByVclNo/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 九、	套牌车验证
	 * 本接口通过指定车牌号、车主姓名及车主电话，验证车主真实性。
	 * 接口返回数据解码后样例：
		{"result":"yes","status":1001}
	 *  */
	public static String checkAreaByVclNo(String token,String vclN,String area) {
		try {
			System.out.println("九、	套牌车验证");
			String p = "token="+token+"&vclN="+vclN+"&area="+area;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/checkAreaByVclNo/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十、	发布货源接口
	 * 提供按始发地、目的地、发货单位、货物类型、所需车辆类型、期望价格、联系方式等信息 发布至车旺智运货源平台服务。
	 * 接口返回数据解码后样例：
		{"result":"1961d5d18c35455cbd044bdb75cb38d7","status":1001}
	 *  */
	public static String pubGoodsSorcInf(String token,String startArea,String endArea,String vtype,String vlen,String vton,String expTime,
			String sendFreq,String cargoId,String gton,String gvol,String contact,String contel,String refPrice ,String priType,String gbidType,String belEup,String userPhone)  {
		try {
			System.out.println("十、	发布货源接口");
			String p = "token="+token+"&startArea="+startArea+"&endArea="+endArea+"&vtype="+vtype+"&vlen="+vlen+"&vton="+vton+"&expTime="+expTime+"&sendFreq="+sendFreq+"&cargoId="+cargoId
					+ "&gton="+gton+"&gvol="+gvol+"&contact="+contact+"&contel="+contel+"&refPrice="+refPrice+"&priType="+priType+"&gbidType="+gbidType+"&belEup="+belEup+"&userPhone="+userPhone;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/pubGoodsSorcInf/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十一、	找车接口->多维度找车
	 * 提供按始发地、目的地、周边距离、货物位置、常运货物类型、车辆类型、车长、载重等信息进行精细化找车查询服务
	 * 本接口提供按照车型、车长、载重、起始地、目的地、多维度查询指定经纬度坐标点为中心查询指定公里范围内的前50辆在线车辆。
	 * 接口返回数据解码后样例：
	{"result":[{"img":"https://vims.sinoiov.com/images/20160608/1465374511927_3.jpg","lat":"34.657181","lon":"88.629231","ratifyLoad":"7000.0","utc":"1477717360000","vcltype":"栏板车","vco":"3","vehicleLength":"3500.0","vid":"6648016378581982626","vno":"陕X***31"}],"status":1001}
	 *  */
	public static String queryVclByMulFs(String token,String lon,String lat,String type) {
		try {
			System.out.println("十一、	找车接口->多维度找车");
			String p = "token="+token+"&lon="+lon+"&lat="+lat+"&type="+type;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/queryVclByMulFs/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十一、	找车接口->车辆ID获取车主信息
	 * 本接口提供按照车辆ID查询对应车主信息。
	 * 接口返回数据解码后样例：
	{"result":{"platecolorid":"2","vehicleOwnerName":"宋慧乔","vehicleOwnerPhone":"13800138000","vehicleno":"陕XB0031"},"status":1001}
	 *  */
	public static String queryInfoByVid(String token,String vid) {
		try {
			System.out.println("十一、	找车接口->车辆ID获取车主信息");
			String p = "token="+token+"&vid="+vid;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/queryInfoByVid/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十二、	车辆驶入/驶出->自定义区域注册接口
	 * 平台实时监控车辆运行轨迹，当车辆驶入预设区域时，平台将车辆驶入事件信息推送到用户数据接收接口。
	 * 返回值示例：
	 * {"result":{"areaid":"1404042286498982724","state":"1"},"status":1001}
	 *  */
	public static String areaReg(String token,String areaname,String lonlat ,int radius,int type,String actiontype) {
		try {
			System.out.println("十二、	车辆驶入/驶出->自定义区域注册接口");
			String p = "token="+token+"&userflag="+apiUser+"&areaname="+areaname+"&lonlat="+lonlat+"&radius="+radius+"&type="+type+"&actiontype="+actiontype;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/areaReg/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十二、	车辆驶入/驶出->车辆订阅接口
	 * 传入需要订阅的车牌号及自定义区域ID，将为进出自定义区域指定需要通知的车牌号
	 * 接口返回数据解码后样例：
	{"result":"1","status":1001}
	 *  */
	public static String vnoReg(String token,String areaid,String vnos) {
		try {
			System.out.println("十二、	车辆驶入/驶出->车辆订阅接口");
			String p = "token="+token+"&userflag="+apiUser+"&areaid="+areaid+"&vnos="+vnos;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vnoReg/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十二、	车辆驶入/驶出->删除车辆订阅接口
	 * 传入需要订阅的车牌号及自定义区域ID，将为自定义区域删除订阅的车牌号
	 * 接口返回数据解码后样例：
	{"result":"1","status":1001}
	 *  */
	public static String vnoDel(String token,String areaid,String vnos) {
		try {
			System.out.println("十二、	车辆驶入/驶出->删除车辆订阅接口");
			String p = "token="+token+"&userflag="+apiUser+"&areaid="+areaid+"&vnos="+vnos;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vnoDel/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十二、	车辆驶入/驶出->删除自定义区域接口
	 * 传入需要订阅的车牌号及自定义区域ID，将为进出自定义区域指定需要通知的车牌号
	 * 接口返回数据解码后样例：
	{"result":"1","status":1001}
	 *  */
	public static String areaDel(String token,String areaid) {
		try {
			System.out.println("十二、	车辆驶入/驶出->删除自定义区域接口");
			String p = "token="+token+"&userflag="+apiUser+"&areaid="+areaid;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/areaDel/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);// 请求访问超时时间,读取数据超时时间
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十三、	异常离线提示->离线车辆注册接口
	 * 平台实时监控车辆运行情况，当车辆离线时长达到预设阀值时，平台将车辆异常离线状态数据推送到用户数据接收接口。
	 * 传入需要订阅的离线车牌号
	 * 接口返回数据解码后样例：
	{"result":"1","status":1001}
	 *  */
	public static String vnoOutReg(String token,String vnos) {
		try {
			System.out.println("十三、	异常离线提示->离线车辆注册接口");
			String p = "token="+token+"&userflag="+apiUser+"&vnos="+vnos;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vnoOutReg/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十三、	异常离线提示->删除离线车辆订阅接口
	 * 平台实时监控车辆运行情况，当车辆离线时长达到预设阀值时，平台将车辆异常离线状态数据推送到用户数据接收接口。
	 * 传入需要订阅的离线车牌号
	 * 接口返回数据解码后样例：
	{"result":"1","status":1001}
	 *  */
	public static String vnoOutDel(String token,String vnos) {
		try {
			System.out.println("十三、	异常离线提示->删除离线车辆订阅接口");
			String p = "token="+token+"&userflag="+apiUser+"&vnos="+vnos;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vnoOutDel/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十四、	车辆停车查询接口
	 * 本接口提供指定车牌号，指定时间段查询车辆停车信息，开始时间和结束时间不能超过24小时。
	 * 接口返回数据解码后样例：
	 *{"result":{"parkInfo":[{"adr":"天津市蓟县田野农家，向东方向，253米","bte":"2017-07-03 10:37:05","ete":"2017-07-03 11:21:42","lat":"39.82045333333333","lon":"117.29147166666667","parkMins":"44.0"},{"adr":"天津市蓟县田野农家，向东方向，232米","bte":"2017-07-03 11:23:52","ete":"2017-07-03 13:05:32","lat":"39.82045333333333","lon":"117.29171333333333","parkMins":"101.0"},{"adr":"天津市蓟县田野农家，向东方向，253米","bte":"2017-07-03 13:40:13","ete":"2017-07-03 13:56:33","lat":"39.82045333333333","lon":"117.29147166666667","parkMins":"16.0"}],"parkSize":3},"status":1001}
	 * */
	public static String vQueryPark(String token,String vclN,String vco,String qryBtm,String qryEtm,String parkMins) {
		try {
			System.out.println("十四、	车辆停车查询接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco+"&qryBtm="+qryBtm+"&qryEtm="+qryEtm+"&parkMins="+parkMins;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vQueryPark/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十五、下发车机信息接口
	 * 本接口通过指定车牌号、指定消息内容向目标车辆的车机上发送消息通知，车机最终以语音播报的方式通知车主或司机。
	 * 接口返回数据解码后样例：
	 *{"result":{"utc":"1499405221100","state":"2"},"status":1001}
	 * */
	public static String sendMessageByVclNo(String token,String vclN,String vco, String type,String info) {
		try {
			System.out.println("十五、下发车机信息接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco+"&type="+type+"&info="+info;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/sendMessageByVclNo/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十六、车辆里程查询接口
	 * 基于中交兴路智能transmap-mileage算法，本接口提供指定车牌号、指定时间段查询车辆实际行驶里程信息，开始时间和结束时间不能超过24小时。
	 *接口返回数据解码后样例：
	 *{"result":{"end":"湖南省岳阳市临湘市张家大屋，向东南方向，178米","endLonLat":"113.49648166666667,29.473815","endTime":"2017-06-28 17:02:36","mileage":"1.3","start":"湖南省岳阳市临湘市李家坡，向东北方向，99米","startLonLat":"113.483715,29.470065","startTime":"2017-05-05 17:02:06"},"status":1001}
	 * *///
	public static String vQueryMileage(String token,String vclN,String vco,String qryBtm,String qryEtm) {
		try {
			System.out.println("十六、车辆里程查询接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco+"&qryBtm="+qryBtm+"&qryEtm="+qryEtm;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vQueryMileage/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 十七、道路运输证验证接口
	 * 本接口通过指定车牌号、道路运输证号码，验证道路运输证信息是否准确。
	 *接口返回数据解码后样例：
	 *{"result":"yes","status":1001}
	 * */
	public static String checkRTCNo(String token ,String vclN,String vco,String rtcNo) {
		try {
			System.out.println("十七、道路运输证验证接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco+"&rtcNo="+rtcNo;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/checkRTCNo/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/**十八 车辆行驶证信息查询接口
	 * 本接口通过指定车牌号、道路运输证号码，验证道路运输证信息是否准确。
	 *接口返回数据解码后样例：
	 *{"result":{"areaName":"陕西省","boxHgt":"--","boxLng":"--","boxWdt":"--","cmpNm":"宋**","ldTn":"1800","prdCdNm":"123999","serviceName":"陕西服务商danwei","servicePhone":"18900000001","vbrndCdNm":"江淮","vclDrwTn":"","vclHgt":"1500","vclLng":"1700","vclTn":"42000","vclTpNm":"农用车","vclWdt":"1600","vclWnrNm":"宋**","vclWnrPhn":"138****8000","vin":"u3221008"},"status":1001}
	 * */
	public static String vQueryLicense(String token ,String vclN,String vco) {
		try {
			System.out.println("十八 、车辆行驶证信息查询接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vQueryLicense/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/**十九、逆地理信息查询接口
	 * 本接口提供传入经纬度及坐标系类型来查询地址。
	 * 接口返回数据解码后样例：
	 *{"result":{"cit":"咸阳市","cou":"泾阳县","des":"陕西省咸阳市泾阳县西苗村，向西方向，737米","pro":"陕西省"},"status":1001}
	 * */
	public static String decodeAddress(String token,String lon,String lat,String type) {
		try {
			System.out.println("十九、逆地理信息查询接口");
			String p = "token="+token+"&lon="+lon+"&lat="+lat+"&type="+type;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/decodeAddress/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/**二十、道路运输证查询接口
	 * 本接口通过指定车牌号、车牌颜色查询道路运输证号码及有效期等信息。
	 * 接口返回数据解码后样例：
	 *{"result": { "roadTransport":"23452","vdtTm": "2016-07-01"}"status": 1001}
	 * */
	public static String vQueryRTCNo(String token ,String vclN,String vco) {
		try {
			System.out.println("二十、道路运输证查询接口");
			String p = "token="+token+"&vclN="+vclN+"&vco="+vco;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/vQueryRTCNo/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/**二十一、发布货源短信接口
	 * 本接口通过指定车牌号、车牌颜色查询道路运输证号码及有效期等信息。
	 * 接口返回数据解码后样例：
	 *{"result":{"msgCotent":"最新货源信息：北京-天津 运15吨设备，求高栏车，长期货源，货主：北京中交 13800138000。退订回复N。","count":"0","state":"1"},"status":1001}
	 * */
	public static String pubGoodsMsg(String token,String vids,String startArea,String endArea,String gType,String vType,String gOwner,String conPhone) {
		try {
			System.out.println("二十一、发布货源短信接口");
			String p = "token="+token+"&vids="+vids+"&startArea="+startArea+"&endArea="+endArea+"&gType="+gType+"&vType="+vType+"&gOwner="+gOwner+"&conPhone="+conPhone;
			System.out.println("参数:"+p);
			p = TransCode.encode(p);//DES加密
			String url = apiUrl+"/pubGoodsMsg/" + p+"?client_id="+client_id;
			DataExchangeService des = new DataExchangeService(5000, 5000);
			System.out.println("请求地址:"+url);
			String res = des.accessHttps(url, "POST");
			res = TransCode.decode(res);//DES解密
			System.out.println("返回:"+res);
			ZhiyunReturnBean bean = JSON.parseObject(res, ZhiyunReturnBean.class);
			analysisStatus(bean);//解析接口返回状态
			System.out.println("------------------------------------------------------");
			return res;
		} catch (Exception e) {
			System.out.println("e:" + e.getMessage());
		}
		return null;
	}
	
	/** 解析接口返回状态 */
	private static void analysisStatus(ZhiyunReturnBean bean) {
		if("1001".equals(bean.getStatus())){
			System.out.println("√	1001	接口执行成功");
		} else if ("1002".equals(bean.getStatus())) {
			System.out.println("×	1002	参数不正确（参数为空、查询时间范围不正确、参数数量不正确）");
		} else if ("1003".equals(bean.getStatus())) {
			System.out.println("×	1003	车辆调用数量已达上限");
		} else if ("1004".equals(bean.getStatus())) {
			System.out.println("×	1004	接口调用次数已达上限");
		} else if ("1005".equals(bean.getStatus())) {
			System.out.println("×	1005	该API账号未授权指定所属行政区划数据范围");
		} else if ("1006".equals(bean.getStatus())) {
			System.out.println("√	1006	无结果");
		} else if ("1010".equals(bean.getStatus())) {
			System.out.println("×	1010	用户名或密码不正确");
		} else if ("1011".equals(bean.getStatus())) {
			System.out.println("×	1011	IP不在白名单列表");
		} else if ("1012".equals(bean.getStatus())) {
			System.out.println("×	1012	账号已禁用");
		} else if ("1013".equals(bean.getStatus())) {
			System.out.println("×	1013	账号已过有效期");
		} else if ("1014".equals(bean.getStatus())) {
			System.out.println("×	1014	无接口权限");
		} else if ("1015".equals(bean.getStatus())) {
			System.out.println("×	1015	用户认证系统已升级，请使用令牌访问");
		} else if ("1016".equals(bean.getStatus())) {
			System.out.println("√	1016	令牌失效");
		} else if ("1017".equals(bean.getStatus())) {
			System.out.println("×	1017	账号欠费");
		} else if ("1018".equals(bean.getStatus())) {
			System.out.println("×	1018	授权的接口已禁用");
		} else if ("1019".equals(bean.getStatus())) {
			System.out.println("×	1019	授权的接口已过期");
		} else if ("1020".equals(bean.getStatus())) {
			System.out.println("×	1020	该车调用次数已达上限");
		} else if ("9001".equals(bean.getStatus())) {
			System.out.println("×	9001	系统异常");
		}
	}
}
